{
  "text": "Meri Maati Mera Desh\nExternal Link\nExternal Link\nExternal Link\nTotal Participation in Sewa Parv\nVisitors\nParticipation in Competitions\nEvents Published\n\"The website content is currently being transitioned, and that it may take a few days for all content to be accessible\"\nAzadi Ka Amrit Mahotsav\nAzadi Ka Amrit Mahotsav is an initiative of the Government of India to celebrate and commemorate 75 years of independence and the glorious history of its people, culture and achievements.\nRead More\nThis Mahotsav is dedicated to the people of India who have not only been instrumental in bringing India thus far in its evolutionary journey but also hold within them the power and potential to enable Prime Minister Narendra Modis vision of activating India 2.0, fuelled by the spirit of Aatmanirbhar Bharat.\nThe official journey of Azadi Ka Amrit Mahotsav commenced on 12th March 2021 which started a 75-week countdown to our 75th anniversary of independence and will end post a year on 15th August 2023. Following are the five themes of Azadi Ka Amrit Mahotsav.\nFreedom struggle\nIdeas@75\nResolve@75\nActions@75\nAchievements@75\nAs we countdown to 15th August 2023, Azadi Ka Amrit Mahotsav aims to further boost this peoples’ movement through collaborative campaigns and outreach across India and the world. Following campaigns are on the lines of nine critical themes aligned with the ‘Panch Pran’ announced by Hon’ble Prime Minister: Women and Children, Tribal Empowerment, Water, Cultural Pride, Lifestyle for Environment (LiFE), Health and Wellness, Inclusive Development, Aatmanirbhar Bharat and Unity.\nWomen and Children\nTribal Empowerment\nWater\nLifestyle for Environment (LiFE)\nHealth and Wellness\nInclusive Development\nAatmanirbhar Bharat\nCultural Pride\nUnity\nQuotes\nLike the history of the freedom movement, the journey of 75 years after independence is a reflection of the hard work, innovation, enterprise of ordinary Indians. Whether in the country or abroad, we Indians have proved ourselves with our hard work. We are proud of our Constitution. We are proud of our democratic traditions. The mother of democracy, India is still moving forward by strengthening democracy. India, rich in knowledge and science, is leaving its mark from Mars to the moon.\nNarendra Modi\nPrime Minister of India\nThe Azadi Ka Amrit Mahotsav means elixir of energy of independence; elixir of inspirations of the warriors of freedom struggle; elixir of new ideas and pledges; and elixir of Aatmanirbharta. Therefore, this Mahotsav is a festival of awakening of the nation; festival of fulfilling the dream of good governance; and the festival of global peace and development.\nNarendra Modi\nPrime Minister of India\nMeri Maati Mera Desh\nKnow More\nTake Pledge\nHar Ghar Tiranga\nKnow More\nUpload Selfie with Tiranga\nDownloads\nKnow More\nUpload Selfie with Tiranga\nDownloads\nCombined Creatives\nTake Pledge\nUpload Selfie with Tiranga\nOngoing Iconic Events\nView All\nIndian Art, Architecture, and Design Biennale 2023\nStart Date\nDecember 8, 2023\nEnd Date\nMarch 31, 2024\nOrganiser -\nMinistry of Culture\nRead More\nIdeas@75\nMeri Maati Mera Desh\nStart Date\nAugust 9, 2023\nEnd Date\nOctober 31, 2023\nOrganiser -\nMinistry of Youth Affairs and Sports and Ministry of Culture\nKnow More\nRead More\nFreedom Struggle\nUpcoming Iconic Events\nView All\n[!UpcomingIconicEventsForHome!]\nGrand Hologram Statue of Netaji\nSpotlight of the Week\nView All\n01 FEB24\nEvent\nMinistry of Culture tableau clinches first spot at...\nKnow More\nAchievements@75\n08 DEC23\nEvent\nIndia Art, Architecture and Design Biennale 2023\nKnow More\nTraditions & Art Forms\n30 OCT23\nEvent\n‘Meri Maati Mera Desh’ finale event to be held at ...\nKnow More\nActions@75\n04 OCT23\nEvent\nOver 100 Crore people participated in the ‘Swachha...\nKnow More\nAchievements@75\n21 SEP23\nEvent\nPrime Minister dedicates ‘Yashobhoomi’ to the natio\nKnow More\nActions@75\n23 AUG23\nEvent\nChandrayaan-3: India creates history by being the ...\nKnow More\nAchievements@75\n15 AUG23\nEvent\nIndependence Day 2023\nKnow More\nFreedom Struggle\n13 AUG23\nEvent\nHar Ghar Tiranga 2023\nKnow More\nFreedom Struggle\n21 JUL23\nEvent\nRevival of ‘Stitched Shipbuilding Method’\nKnow More\nActions@75\n16 JUL23\nEvent\nISRO successfully launches Chandrayaan-3\nKnow More\nActions@75\nFive Themes of Azadi Ka Amrit Mahotsav\nFreedom Struggle\nIdeas@75\nResolve@75\nActions@75\nAchievements@75\nFreedom Struggle\nThis theme anchors our commemoration initiatives under Azadi Ka Amrit Mahotsav. It helps bring alive stories of unsung heroes whose sacrifices have made freedom a reality for us and also revisits the milestones, freedom movements etc. in the historical journey to 15 August, 1947.\nProgrammes under this theme include Birsa Munda Jayanti (Janjatiya Gaurav Diwas), Declaration of Provisional Government of Free India by Netaji, Shaheed Diwas etc.\nSpecial initiatives of Ministry of Culture under this theme include the following\nRead More\nView All\nIdeas@75\nThis theme focuses on programmes and events inspired by ideas and ideals that have shaped us and will guide us as we navigate through this period of Amrit Kaal (25 years between India@75 and India@100). The world as we knew it is changing and a new world is unfolding. The strength of our convictions will determine the longevity of our ideas. Events and programmes under this theme include popular, participatory initiatives that help bring alive India’s unique contribution to the world. These include events and initiatives such as\nKashi Utsav\ndedicated to Hindi literary luminaries from the land of Kashi,\nPost Cards to Prime Minister\nwherein more than...\nRead More\nView All\nResolve@75\nThis theme focuses on our collective resolve and determination to shape the destiny of our motherland. The journey to 2047 requires each one of us to rise up and play our part as individuals, groups, civil society, institutions of governance etc. Only through our collective resolve, well laid out action plans and determined efforts will ideas translate into actions. Events and programmes under this theme include initiatives such as\nConstitution Day, Good Governance Week etc.\nthat help bring alive our commitment towards the ‘PLANET AND PEOPLE’ while being driven by a deep sense of PURPOSE...\nRead More\nView All\nActions@75\nThis theme focuses on all the efforts that are being undertaken to help India take its rightful position in the new world order emerging in a post covid world by highlighting the steps being taken to implement policies and actualise commitments. It is driven by Prime Minister Modi’s clarion call of\nSABKA SAATH. SABKA VIKAS. SABKA VISHWAS, SABKA PRAYAS.\nIt encompasses Government policies, schemes, action plans along with commitments from businesses, NGOs, civil society that help actualise our ideas and help us collectively create a better tomorrow. Programmes under this theme include initiatives such as\nGati Shakti - National Master Plan for\n...\nRead More\nView All\nAchievements@75\nThis theme focuses on marking the passage of time and all our milestones along the way. It is intended to grow into a public account of our collective achievements as a 75-year-old independent country with a legacy of 5000+ years of ancient history.\nEvents and programmes under this theme include initiatives such as\nSwarnim Vijay Varsh dedicated to the victory of 1971, launch of Shreshtha Yojana during Mahaparinirvan Diwas etc...\nRead More\nView All\nVideo Gallery\nView All\nAct on Thaayin Manikodi Paareer\nSoun Wattan by Saurabh Zadoo and Indian Harmonies...\nVande Mataram By Padma Shri Hariharan\nJai Ho By Ustad Arshad Ali Khan, Pratibha Singh...\nHonble Prime Minister Shri Narendra Modis...\nAct on Thaayin Manikodi Paareer\nSoun Wattan by Saurabh Zadoo and Indian Harmonies...\nVande Mataram By Padma Shri Hariharan...\nJai Ho By Ustad Arshad Ali Khan, Pratibha Singh...\nHonble Prime Minister Shri Narendra Modis...\nSocial Feeds\nTop",
  "title": "Home",
  "url": "https://amritmahotsav.nic.in/digital-district-repository",
  "source": "vedicheritage",
  "format": "html",
  "language": "en",
  "category": "Bhagavad Gita",
  "author": null,
  "scraped_at": "2025-10-17 15:06:30.878719",
  "file_size": 82257,
  "encoding": "utf-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}