{
  "text": "Upanishads\nChandogyopanishad\nKauthuma Upanishads\nChandogyopanishad\nKenopanishad\nAarsheyopanishad\nChandogyopanishad\nChandogya Upanishad\nbelongs to Tandya school under Kauthuma Samhita of the Samaveda. Out of the ten chapters of the Chandogya Brahmana; chapters third to tenth are considered as the Chandogya Upanishad.\nIt presents ancient source of Vedantic philosophy and ranks as one of the most prominent among the major group of the mystical and philosophical texts. The Chandogya Upanishad enumerates primary sources of divine inspiration, deepest subjective consciousness and the process for transformation of the individual life to the universal life.\nIt is divided into eight Prapathakas and presents the importance of speech, language, songs and chants to the man’s quest for wisdom and ultimate perfection. Containing the lilting metric structure and embedded philosophical thoughts, it has been recognized as most cited text in Hinduism.\nThe Upanishad enumerates unity between the individual soul and the universal soul, as it says “This is my Soul in the innermost heart, greater than the earth, greater than the aerial space, greater than these worlds. This soul, this Self of mine is that Brahman.”  (3.14.3-3.14.4)\nSamhita\nKauthuma Samhita (Samaveda)\nBrahmanas\nTandya Brahmana\nSadavinsa Brahmana\nSamavidhana Brahmana\nAarseya Brahmana\nDevatadhyaya Brahmana\nChandogya Brahmana\nSamhitopanisad Brahmana\nVansha Brahmana\nAranyaka\nTalavakara Aranyaka\nE-Book\nChandogyopanishad\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "Chandogyopanishad | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/upanishads/chandogyopanishad/",
  "source": "vedicheritage",
  "format": "html",
  "language": "en-US",
  "category": "Upanishads",
  "author": null,
  "scraped_at": "2025-10-17 15:04:45.831338",
  "file_size": 178501,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}