{
  "text": "Upanishads\nMaitrayani Upanishad\nUpanishad\nMaitrayani Upanisad\nMaitrayani Upanishad\nThe\nMaitrayani Upanishad\nbelongs to Maitrayani Samhita of the Krishna Yajurveda. It is also called as Maitrayanai- Brahmana Upanishad.\nIt is divided into seven Prapathankas, out of which, the first Prapathaka presents introductory principles, Prapathaka second, third, and fourth enumerates the metaphysical questions related to the Soul and Prapathakas fifth to seventh are identified as supplementary.\nLike many of the Upanishads, the Maitrayani Upanishad describes the teachings in the form of a dialogue between the Guru (master) and the Sishya (disciple). Maitrayani Upanishad defines Brahman as the ultimate source of the intelligence of living beings “He who acts, is the element self; he who causes to act, is the inner man (immortal Self). Now as even a ball of iron, pervaded by fire, hammered by smiths, becomes manifold  forms, hammered by guna (qualities, personality), becomes manifold. And as when the ball of iron is hammered, the fire is not overcome (unaffected), so the inner man is not overcome, only element Self is overcome.” (3.3).\nPresenting the ultimate spiritual doctrines, this Upanishad teaches to renounce all thoughts, compassions and desires. As far as the tradition is concerned, Maitrayani Upanishad have been a great influence on the major schools of Yoga and Hindu Philosophy.\nSamhita\nKrishna Yajurveda\nMaitrayani Samhita\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "Maitrayani Upanishad | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/upanishads/maitrayani-upanishad/",
  "source": "vedicheritage",
  "format": "html",
  "language": "en-US",
  "category": "Upanishads",
  "author": null,
  "scraped_at": "2025-10-17 14:34:20.985650",
  "file_size": 177646,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}