{
  "text": "उपनिषद्\nMandukyopanishad\nUPANISHADS\nMandukyopanishad\nMundakopanishad\nPrashnopanishad\nMandukyopanishad\n॥ अथ माण्डुक्योपनिषत् ॥\nॐ इत्येतदक्षरमिदꣳ सर्वं तस्योपव्याख्यानंभूतं भवद् भविष्यदिति सर्वमोङ्कार एवयच्चान्यत् त्रिकालातीतं तदप्योङ्कार एव ॥ १॥\nसर्वं ह्येतद् ब्रह्मायमात्मा ब्रह्म सोऽयमात्मा चतुष्पात् ॥ २॥\nजागरितस्थानो बहिष्प्रज्ञः सप्ताङ्ग एकोनविंशतिमुखः स्थूलभुग्वैश्वानरः प्रथमः पादः ॥ ३॥\nस्वप्नस्थानोऽन्तः प्रज्ञाः सप्ताङ्ग एकोनविंशतिमुखःप्रविविक्तभुक्तैजसो द्वितीयः पादः ॥ ४॥\nयत्र सुप्तो न कञ्चन कामं कामयते न कञ्चन स्वप्नं पश्यति तत्सुषुप्तम् । सुषुप्तस्थान एकीभूतः प्रज्ञानघन एवानन्दमयोह्यानन्दभुक् चेतो मुखः प्राज्ञस्तृतीयः पादः ॥ ५॥\nएष सर्वेश्वरः एष सर्वज्ञ एषोऽन्तर्याम्येष योनिः सर्वस्यप्रभवाप्ययौ हि भूतानाम् ॥ ६॥\nनान्तःप्रज्ञं न बहिष्प्रज्ञं नोभयतःप्रज्ञं न प्रज्ञानघनंन प्रज्ञं नाप्रज्ञम् । अदृष्टमव्यवहार्यमग्राह्यमलक्षणंअचिन्त्यमव्यपदेश्यमेकात्मप्रत्ययसारं प्रपञ्चोपशमंशान्तं शिवमद्वैतं चतुर्थं मन्यन्ते स आत्मा स विज्ञेयः ॥ ७॥\nसोऽयमात्माध्यक्षरमोङ्करोऽधिमात्रं पादा मात्रा मात्राश्च पादाअकार उकारो मकार इति ॥ ८॥\nजागरितस्थानो वैश्वानरोऽकारः प्रथमा मात्राऽऽप्तेरादिमत्त्वाद्वाऽऽप्नोति ह वै सर्वान् कामानादिश्च भवति य एवं वेद ॥ ९॥\nस्वप्नस्थानस्तैजस उकारो द्वितीया मात्रोत्कर्षात्उभयत्वाद्वोत्कर्षति ह वै ज्ञानसन्ततिं समानश्च भवतिनास्याब्रह्मवित्कुले भवति य एवं वेद ॥ १०॥\nसुषुप्तस्थानः प्राज्ञो मकारस्तृतीया मात्रा मितेरपीतेर्वामिनोति ह वा इदं सर्वमपीतिश्च भवति य एवं वेद ॥ ११॥\nअमात्रश्चतुर्थोऽव्यवहार्यः प्रपञ्चोपशमः शिवोऽद्वैतएवमोङ्कार आत्मैव संविशत्यात्मनाऽऽत्मानं य एवं वेद ॥ १२॥॥\nइति माण्डुक्योपनिषत् समाप्\nSamhita\nShaunaka Samhita (Atharvaveda)\nBrahmana\nGopatha Brahmana\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "Mandukyopanishad | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/hi/upanishads/mandukyopanishad/",
  "source": "vedicheritage",
  "format": "html",
  "language": "hi-in",
  "category": "Upanishads",
  "author": null,
  "scraped_at": "2025-10-17 15:05:07.357055",
  "file_size": 187434,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}