{
  "text": "Samhitas\nAtharvaveda Samhitas\nSamhitas\nShaunaka Samhita\nVideo\nAudio\nPaippalada Samhita\nLinks\nअथर्ववेद की महत्ता और उसकी समसामयिकता\n(अनन्त श्री विभूषित द्वारका शारदा पीठाधीश्वर जगद्गुरु शंकराचार्य स्वामी श्रीस्वरुपानन्द\nसरस्वतीजी महाराज)\nअथर्ववेद का संक्षिप्त परिचय\n(श्रीऋषिरामजी रेग्मी)\nBooks on Atharvaveda\n(Source: Kalanidhi Reference Library, IGNCA)\nAtharvaveda Samhitas\nA. Nature and Importance :\nThe Veda of the\nAtharvan\nis the Atharvaveda.\nAtharvan\ndenotes directions and mantras especially in connection to ward off evil and hardship and also contains philosophical thoughts. ‘\nAtharvan\n‘ originally means ‘priest’ and the Mantras in the Atharvaveda-Samhita were brought to light by Rishi Atharva.\nAccording to the etymology of the Nirukta, Atharvan is the name given to a stable-minded person who is immovably firm i.e., Yogi. The oldest name, however, by which this Veda is known in Indian literature is ‘Atharvangirasa-Veda’, that is the ‘Veda of the Atharvans and the Angiras’. Angiras too were a group of schools and priests.\nAccording to Patanjali, Atharvaveda had nine Shakhas, but the Samhita of the Atharvaveda is today available only in two rescensions – the Shaunaka and the Paippalada. It is the Shaunaka-Samhita that is frequently meant when the Atharvaveda is mentioned in ancient and modern literature. It is a collection of 730 hymns containing 5987 Mantras, divided into 20 books (\nKandas\n). Some 1200 verses are derived from the Rigveda. About one sixth of the text of the Atharvaveda including two entire books (15 and 16) is written in prose, similar in style and language to the Brahmanas, the rest of the text is in poetic verses.\nSome traditions prescribe that this Veda should be known as Brahma\nRitvik\nwho used to supervise the process of\nYaga\nor sacrifice. In sacrificial ceremonies he was supposed to know all the three Vedas, but usually he used to represent the Atharvaveda. Due to his association, the Atharvaveda is also named ‘\nBrahmaveda\n‘, the Veda of Brahma priest.\nThe Atharvaveda is the oldest literary monument of Indian medicine. It is believed to be the origin of Ayurveda, the Indian science of medicine. There are a series of Mantras related to cure various physical and mental diseases. Another class of hymns includes prayers for protection from the bite of snakes or injurious insects. We find mention and application of medicines and medicinal herbs. This feature distinguishes the Atharvaveda from the rest of the Vedas.\nPhilosophical portions of this Samhita present a fairly high development of metaphysical thought. The chief ideas of the Upanishads, the conception of a highest god as creator and preserver of the world (\nPrajapati\n), and even the ideas of an impersonal creative principle, besides a number of philosophical terms such as Brahman,\nTapas, Asat, Prana, Manas\nmust have been the common property of large circles – at the time when these hymns originated. Therefore, the study of the philosophical ideas, revealed in the Atharvaveda, is important to understand the development of Indian Philosophical thought.\nAtharvaveda is the only Veda which is related to both worldly happiness and spiritual knowledge. Vedic commentator Sayana has praised this for fulfilling both ends – this world and the other world. Thus, it appears to be an interesting text for a general reader of the Vedic literature.\nB. Contents :\nThe Atharvaveda is looked upon as the Veda of varied knowledge. It contains numerous Mantras, which according to their subject-matter, can be broadly divided into three categories: 1. Related to the cure of diseases and destruction of adverse forces. 2. Related to establish peace, protection, health, wealth, friendship and long life. 3. Related to the nature of Supreme Reality, time, death and immortality.\nBloomfield has divided the subject of Atharvaveda into many categories, such as\nBhashijya, Paushtika, Prayashctta, Rajakarma, Strikarma,Darshana, Kuntapa\netc. Here some Important and famous Suktas of Atharvaveda are listed to have a general view its subject:\nBhumi-Sukta (12.1)\nBrahmacarya-Sukta (11.5)\nKala-Suktas (11.53, 54)\nVivaha-Sukta (14th Kanda)\nMadhuvidya-Sukta (9.1)\nSamanasya-Sukta (3.30)\nRohita-Sukta (13.1-9)\nSkambha-Sukla (10.7)\nSo, the Atharvaveda is an encyclopedia of many subjects. It reflects the life of the Vedic people. Their thoughts related to philosophical, social, educational, political, agricultural, scientific and medical matters are found in this Samhita.\nBrahmana\nGopatha Brahmana\nUpanishad\nPrasanopanisad\nMundakopanisad\nMandukyopanisada\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "Atharvaveda Samhitas | Vedic Heritage Portal",
  "url": "http://vedicheritage.gov.in/samhitas/atharvaveda-samhitas/",
  "source": "vedicheritage",
  "format": "html",
  "language": "en-US",
  "category": "Vedas",
  "author": null,
  "scraped_at": "2025-10-17 15:03:55.970067",
  "file_size": 184369,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}