{
  "text": "Samhitas\nRigveda\nSamhitas\nShakala Samhitas\nMandala Krama\nMaharashtra Tradition\nKerela Tradition\nAshtaka Krama\nAshvalayana Samhita\nRelated Links\nऋग्वेद का परिचय एवं वैशिष्ट्य\n(श्रीराम अधिकारी जी)\nTechniques for the Recitation of Sakalasamhita prevalent in Kerala Tradition\n(Prof. C. M. Neelakandan)\nRigveda Shakala Samhita Urdu Translation\n(S. Mohammed Reza Jalali Naini)\nBooks on Rigveda\n(Source: Kalanidhi Reference Library, IGNCA)\nRigveda\nRIGVEDA\nA. Nature and Importance:\nThe Rigveda is the oldest compilation of human wisdom. This Samhita (Collection) is unique in its nature. In fact, it is not a book, but a compilation composed of several books which can be individually distinguished from each other. The present from of this Samhita clearly indicates that the collection is not a single work, but consists of older and later elements. Various indications of language, style and ideas prove this point. Different hymns of this Samhita were composed long before they were systematically arranged. Being a compilation of different stages, there is something which stamps the Rigveda with an individuality of its own. It is much more natural in character and form than other Samhitas.\nThe Rigveda represents the earliest sacred book of India. It is oldest and biggest amongst all the four Vedas. All the features of Classical Sanskrit poetry can be traced to the Rigveda. In it we find the seeds of India’s religious and philosophical development. Thus, both for its poetry and its religious and philosophical importance, the Rigveda should be studied by one who wants to understand Indian literature and spiritual culture. The value of the Rigveda today is not confined to India, for its well-preserved language and mythology have helped a better understanding of languages, literatures and cultures of a whole world.\nB. Form and\nClassification\nThe whole of the Rigveda-Samhita is in form of verses, known as Rik.\n‘Rik’ is the name given to those Mantras which are meant for the praise of the deities. Thus the collection (Samhita) of Riks is known as Rigveda-Samhita. Only one recession or school (Shakha) of the Rigveda is available today and it is the Shaakala. The Rigveda Samhita contains about 10552 Mantras, classified into ten books called Mandalas. Each Mandala is divided into several sections called Anuvakas. Each Anuvaka consists of a number of hymns called Suktas and each Sukta is made up of a number of verses called riks. This division of the Rigveda is most popular and systematic. There are two ways of dividing the contents of the Rigveda, but today other division is uncommon among the students of the Veda.\nA Sukta is a group of Mantras. The number of Mantras in a Sukta is not fixed. Some Suktas have a small number of Mantras while others have a large number of Mantras. It is important to note that every Sukta has a seer i.e. Rishi, a deity i.e. Devata and a metre i.e. Chandas . The Samhita of the Rigveda comprises 10 Mandalas, 85 Anuvakas, 1028 Suktas and 10552 Mantras. Usually Anuvaka is not mentioned for the reference of a Mantra of the Rigveda. For example RV 3.16.7 simply means the seventh Mantra of the sixteenth Sukta of the third Mandala of the Rigveda.\nThrough this chart we can know the division of Mandalas, number of Suktas in each Mandala and name of Rishis of some Mandalas.\nMandala\nSuktas\nMantras\nName of Rishis\nMaducchanda, Medhatithi, Gotama and many others\nGritasamada and his family\nVishvamitra and his family\nVamadeva and his family\nAtri and his family\nBhardvaja and his family\nVashistha and his family\nKanva, Angira and their family\nSoma Devata but different Rishis\nVimada, Indra, Shachi and many other\nC. Some Important Hymns:\nAmong 1028 Suktas of the Rigveda Samhita some suktas are very popular and frequently referred by the readers of Vedas. Some of them are:\nPurusha Sukta\nHiranya-garbha Sukta\nDhana-anna-dana Sukta\nAksha Sukta\nNasadiya Sukta\nDuhsvapna-nashna Sukta\nYama-yami-samvada Sukta\nBesides, there are Suktas offered to different deities, such as, Indra, Maruta, Varuna, Usha, Surya, Bhumi, Soma, Agni etc.\nThus we can briefly say about the contents of Rigveda that it has various subjects, which are narrated by Vedic seers poetically, philosophically or religiously.\nMajor part of the Article contributed by Dr.Shashi Tiwari (Retd.), Sanskrit Department, Delhi University\nBrahmanas\nAitareya-Brahmana\nKausitaki (or Sankha-yana brahmana)\nAranyakas\nAitareyaranyaka\nKausitaki-aranyaka\nUpanishads\nAitareyopanisad\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "Rigveda | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/samhitas/rigveda/#skip_content",
  "source": "vedicheritage",
  "format": "html",
  "language": "en-US",
  "category": "Vedas",
  "author": null,
  "scraped_at": "2025-10-17 15:06:35.102234",
  "file_size": 188186,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}