{
  "text": "Samhitas\nSamaveda\nKauthuma Samhita\nJaiminiya Samhita\nRanayaniya Samhita\nRelated Links\nसामवेद का परिचय एवं वैशिष्ट्य\n(श्रीराम अधिकारीजी)\nमाध्यन्दिनीय यजुर्वेद एवं सामवेद की पाठ-परम्परा\n(प्रो॰ डॉ॰ गोपालचन्द्र मिश्र)\nJaiminiyasamagana- Origin, Structure, Accentuation,\nOral Gana Tradition and Commentaries\n(Prof. C. M. Neelakandan)\nTechnique of Recitation with reference to Samagana (Jaiminiya)\nprevalent in Kerala Tradition\n(Prof. C. M. Neelakandan)\nSamavedasamhitai (Tamil Translation, Part-I)\n(H.H. Kasivasi Shivananda Yathindira)\nBooks on Samaveda\n(Source: Kalanidhi Reference Library, IGNCA)\nSamaveda\nA. Nature and Importance:\nThe Samaveda is shortest of all the four Vedas. It is closely connected with the Rigveda. It is important to note that the Samhita of the Samaveda is an independent collection (Samhita), yet it has taken many verses, a large number indeed, from the Samhita of Rigveda. These verses are chiefly derived from the eighth and the ninth Mandalas of the Rigveda. The Samaveda is compiled exclusively for ritual application, for its verses are all meant to be chanted at the ceremonies of the Soma-sacrifice and procedures derived from it. The Samaveda is, therefore, specially intended for the\nUdagatr\npriest. Its stanzas assume their proper character of musical\nsamans\nor chants only in the various song-books called\nGanas\n. According to the Jaiminiya Sutra – ‘Melody is called Saman.’\nTraditional the Vedas are spoken as\n‘Trayi\n‘, because thay are composed of three kinds in mantras- Rcs or verses, Yajus or prose, Saman or chants.\nAmong the four Vedas, the Samaveda is regarded as the foremost. In the Bhagavadgata, where Lord Krishna has declared “Among the Vedas I am Samaveda”-\nVedanama Samavedosmi\n(Gita, 10.22). Here Indra, Agni and Soma deities are mainly invoked and praised but most of the time these prayers seem to be the invocations for the Supreme Being. In the spiritual sense Soma represents All-pervading, Glorious Lord and Brahman, who is attainable only through devotion and musical chanting. Thus major theme of the Samaveda can be regarded as worship and devotion (\nUpasana\nB. Form and Division:\nAccording to the ancient tradition, told by Patanjali, the Samaveda had 1000 rescensions (\nShakhas\n). But at present there are only three rescensions. These are –\n(1)\nKauthuma\n(2)\nJaiminiya\n(3)\nRanayaniya\nBut today, Kauthuma Shakha is known more prominently. The Samaveda- Samhita of Kauthumas, consists of two parts, Archika and gana. The Archika is also separated in two. – the Purvarcika, and the Uttararcika. First part contains four parts:\nAgneya – 114 verses for Agni\nAindra – 352 verses for Indra\nPavamana – 119 verses for Soma Pavamana\nAranya – 55 verses for Indra, Agni, Soma etc. (And Mahanamni Mantras -10)\nThis part consists of 650 verses.\nThe Uttararcika, the second part of the Samaveda-Samhita, consists total number of 1225 verses. So the total number of verses in the Samaveda-Samhita is 1875. Amongst these 1771 Verses are from the Rigveda Only 99 verses of this Samhita are not found in the Rigveda- Samhita and thus are regarded to be of Samaveda itself.\nThe Gana part of the Samavead is also divided into Prakrti Gana and Uha Gana. Strictly speaking, the Uha Gana is not part of the original Veda but the application of the Samans from the Prakrti Gana based on the Purvarcika to the mantras of the Uttararcika.\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "Samaveda | Vedic Heritage Portal",
  "url": "http://vedicheritage.gov.in/samhitas/samaveda-samhitas/",
  "source": "vedicheritage",
  "format": "html",
  "language": "en-US",
  "category": "Vedas",
  "author": null,
  "scraped_at": "2025-10-17 15:04:28.825552",
  "file_size": 181771,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}