{
  "text": "संहिता\nऋग्वेद संहिता\nआश्वलायन संहिता\nClick here to View Volume I\nASVALAYANA SAMHITA OF THE RGVEDA with PADAPATHA\nThe Purana literature gives ample information about the existence of Sakha-Samhitas. Deviations in text, order and number of rk mantras started giving rise to different Sakha-Samhita from the time of Acarya Paila; Patanjali referring to twenty- one Sakha-Samhita of the Rgveda.\nThis publication is an attempt to examine the existence of Sakha-Samhita of the Rgveda as mentioned by the Puranas, Patanjali, Mahidasa and other authorities, scrutinizing textual evidence in support of them. The focus is, however, on the Asvalayana-Samhita, with a background on Acarya Asvalayana and exploring the antiquity, treatment of accent and Padapatha of the text by referring to various sources. Published in two volumes it presents a detailed and systematic study of the full text of the Asvalayana-Samhita of the Rgveda.\nThe verses of the ten Mandalas are given in original form and examined critically in a thorough study. The additional mantras of the Asvalayana-Samhita are also presented with the original Sanskrit verses followed by their translation in Hindi and English. Asvalayana-Samhita of the Rgveda, a critical edition (with Padapatha) of which has been made available in print for the first time, must be put on shelves by every library which has interest in Indian classical literature. Moreover these volumes are bound to interest Vedic scholars and students in particular and Indological scholars of Indian religion and culture in general.\nRecitation (Veda paatha) of Asvalayana­Saṁhita of Ṛigveda is not available\nClick here to View Volume II\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "आश्वलायन  संहिता | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/hi/samhitas/rigveda/ashvalayana-samhita/",
  "source": "vedicheritage",
  "format": "html",
  "language": "hi-in",
  "category": "Vedas",
  "author": null,
  "scraped_at": "2025-10-17 15:06:22.551540",
  "file_size": 184998,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}