{
  "text": "वेदनगस\nकल्प\nVEDANGAS\nशिक्षा\nकल्प\nव्याकरण\nनिरुक्त\nछन्द\nज्योतिष\nKalpa\nThe second Vedanga is\nKalpa\n(ritual) which is called the arms of the Veda Purusha. It is especially intended for the proper application of the Vedic texts. The oldest Kalpasutras are those which in their contents are directly connected with the Brahmanas and Aranyakas. It was the ritual (\nKalpa\n), the chief contents of the Brahmanas, which first received systematic treatment in the manuals called the Kalpasutras. They contain the rules in the Sutra style, referring to sacrifices, with the omission of all things which are not immediately connected with the ceremonial. They are more practical than the Brahmanas which for the most part are taken up with mystical, historical, mythological, etymological and theological discussions. They are also considered significant for the study of Vedic culture and society.\nThere are four types of the Kalpasutras:\n(1)\nShrauta-sutras\n, dealing with Shrauta sacrifices\n(2)\nGrihya-sutras\n, dealing with the domestic ceremonies\n(3)\nDharma-sutras\n, dealing with the religious and social laws\n(4)\nShulba-sutras\n, dealing with the rules of measurement of the fire-altars etc.\nVeda\nSrautasutra\nSulbasutra\nGrihyasutra\nDharmasutra\nṚgveda\nĀśvalāyana Śrautasūtra\nSāṅkhāyana Śrautasūtra\nÂśvalāyana-Gṛhyasūtra\nKausîtaki-Gṛhyasūtra (Bāṣkala śakha)\nŚāṅkhāyana-Gr̥hyasūtra\nVasishtha Dharmasūtra\nŚukla Yajurveda\nKātyāyana Śrautasūtra\nKātyāyana Śulbasûtra\nPāraskara-Gṛhyasūtra\nKatyayana-Gṛhyasūtra\nVishnu Dharmasūtra\nKṛsna Yajurveda\nBaudhāyana Śrautasūtra\nVādhūla Śrautasūtra\nMānava Śrautasūtra\nBharadvāja Śrautasūtra\nĀpastamba Śrautastūra\nHiraṅyakeśi Śrautasūtra\nVārāha Śrautasūtra\nVaikhānasa Śrautasūtra\nBaudhāyana Śulbasûtra\nMānava Śulbasûtra\nĀpastamba Śulbasûtra\nBaudhāyana-Gṛhyasūtra\nHiraṇyakeśi-Gṛhyasūtra(Satyāsādha-Gṛhyasūtra)\nMānava-Gṛhyasūtra\nBhāradvāja-Gṛhyasūtra\nĀpastamba-Gṛhyasūtra\nĀgniveśya-Gṛhyasūtra\nVaikhānasa-Gṛhyasūtra\nKāthaka-Gṛhyasūtra\n(Laugāksi-Gṛhyasūtra)\nVārāha-Gṛhyasūtra\nVādhûla-Gṛhyasūtra\nKapisthala-Katha Gṛhyasūtra\nBaudhāyana Dharmasūtra\nĀpastamba Dharmasūtra\nSāmaveda\nLātyāyana Śrautasūtra\nDrāhyāyana Śrautasūtra\nJaiminiya Śrautasūtra\nGobhila-Gṛhyasūtra\nKhādira-Gṛhyasūtra(Drāhyāyana-Gṛhyasūtra)\nJaiminiya-Gṛhyasūtra\nKauthuma-Gṛhyasūtra\nGautama Dharmasūtra\nAtharvaveda\nVaitāna Śrautasũtra\nKauśika Gṛhyasūtra\nLinks\nVaikhānasa-Dharma-Sūtra\n(Prof. M. Srimannarayan Murty)\nVaikhānasa-Śrauta-Sūtra\n(Prof. M. Srimannarayan Murty)\nवैदिक धर्म-संस्कारों एवं संस्कृति का समग्र जन जीवन पर प्रत्यक्ष प्रभाव\n(जगद्गुरु रामानुजाचार्य स्वामी श्री श्यामनारायणाचार्यजी महराज)\nवैदिक साहित्य का परिचय ‘कल्पसूत्र’\n(पं॰ श्रीरामगोविन्दजी त्रिवेदी)\nवैदिक गृह्य सूक्तों में संस्कारीय सदाचार\n(डॉ॰श्रीसीतारामजी सहगल शास्त्री)\nशुल्बसूत्र एवं वास्तुशास्त्र में आधाराधेय सम्बन्ध\n(विद्यावाचस्पतिः डॉ0 सुन्दरनारायणझाः)\nMultimedia Link\nकल्प वेदाङ्ग का सामान्य परिचय\nकल्प वेदाङ्ग का सामान्य परिचय\nगृह्यसूत्र एक संक्षिप्त परिचय\nभारतीय संस्कृति के अनुसार मनुष्य जीवन के चार आश्रम होते हैं। आश्रम अर्थात् अवस्था। प्रथम ब्रह्मचर्य आश्रम है जो जन्म से लेकर जीवन के पच्चीस वर्ष तक होता है। द्वितीय गृहस्थ आश्रम जो छब्बीस वर्ष से लेकर पचास वर्ष पर्यन्त होता है। तृतीय वानप्रस्थ आश्रम जो इक्यावन वर्ष से लेकर पचहत्तर वर्ष एवं चतुर्थ संन्यास आश्रम जो छियत्तर वर्ष से लेकर जीवन पर्यन्त होता है।\nगृह्यसूत्र मनुष्य जीवन के द्वितीय अवस्था गृहस्थ आश्रम के नियमों का वर्णन करता है। गृहस्थ आश्रम के नियमों का वर्णन करने वाले सूत्र हैं अतः इनको गृह्यसूत्र कहते हैं।  मनुष्य के व्यक्तित्व का विकास उसके संस्कारों पर आधारित होता है, जो गर्भाधान से लेकर अन्त्येष्टि तक शास्त्रों के अनुसार सम्पादित किये जाते हैं। संस्कार शब्द सम् उपसर्ग पूर्वक कृ धातु से घञ् प्रत्यय करने पर निष्पन्न होता है, जिसका अर्थ होता है- दोषों का निराकरण करते हुए गुणों की आधान क्रिया का सम्पादन करना। गृह्य सूत्रों में सस्कारों की संख्या 16 है, जो इस प्रकार है- गर्भाधान, पुंसवन, सीमन्तोन्नयन,जातकर्म, नामकरण, निष्क्रमण, अन्नप्राशन, चूडाकर्म, विद्यारम्भ, कर्णभेद, उपनयन, वेदारम्भ, समावर्तन, विवाह, केशान्त और अन्त्येष्टि।\nउपर्युक्त संस्कारों की विधियां, नियम एवं संस्कार का समय इत्यादि विषय गृह्यसूत्रों में विस्तार से वर्णित है। भारतीय गृहस्थ जीवन की पवित्रता, दैवीय बल के प्रति पूर्ण आस्था का स्वरूप तथा आदर्श जीवन पद्धति का स्वरूप कर्मकाण्ड के माध्यम से गृह्यसूत्रों में व्यवस्थित रूप से अभिव्यक्त किया गया है। हमारे जीवन में नित्य प्रति जाने-अनजाने कुछ गलतियां या दोष होते हैं और इन्हीं के प्रायश्चित्त के लिए बलिवैश्वदेव, देवयज्ञ, भूतयज्ञ, मनुष्ययज्ञ, तथा पितृयज्ञ -इन पंचमहायज्ञों का विधान, गृह्यसूत्रों में विस्तृत रूप से वर्णित है। साथ ही इनमें मनुष्य जीवन के लिए उपयोगी गृहनिर्माण विधि, अपशकुन निवारण की विधियों के साथ-साथ पुनर्जन्म एवं स्वर्गादि की मान्यता पर भी प्रकाश डाला गया है।\nवर्तमान समय में उपलब्ध गृह्यसूत्र इस प्रकार है-\nऋग्वेद\nआश्वलायन गृह्यसूत्र\nशांखायन गृह्यसूत्र\nकौषीतकी गृह्यसूत्र\nशुक्ल यजुर्वेद\nपारस्कर गृह्यसूत्र\nकृष्ण यजुर्वेद\nबौधायन गृह्यसूत्र\nमानव गृह्यसूत्र\nहिरण्यकेशी/सत्याषाढ गृह्यसूत्र\nभारद्वाज गृह्यसूत्र\nआपस्तम्ब गृह्यसूत्र\nकाठक गृह्यसूत्र\nलौगाक्षि गृह्यसूत्र\nअग्निवेश्य गृह्यसूत्र\nवाराह गृह्यसूत्र\nवैखानस गृह्यसूत्र\nवाधूल गृह्यसूत्र\nसामवेद\nगोभिल गृह्यसूत्र\nखदिर गृह्यसूत्र\nजैमिनीय गृह्यसूत्र\nकौथुम गृह्यसूत्र\nद्राह्यायण गृह्यसूत्र\nअथर्ववेद\nकौशिक गृह्यसूत्र\nधर्मसूत्र एक संक्षिप्त परिचय\nधर्म शब्द धृञ् धारणे धातु से …. प्रत्यय करने से निष्पन्न होता है, जिसका अर्थ है धारण करना, पालन करना। धर्म शब्द का अर्थ समय के अनुसार सदा परिवर्तनशील रहा है। ऋग्वेद (01.187.01) में इसका अर्थ ‘धारक एवं पोषक’ है। यजुर्वेद माध्यन्दिन संहिता (II- 03; V-27) में धर्म शब्द का प्रयोग ‘आचरण के नियम’ के अर्थ में प्रयोग हुआ है। अथर्ववेद में धर्म शब्द ‘यज्ञयाग आदि कर्मजन्य पुण्य’ के अर्थ में प्रयोग हुआ है। छान्दोग्य उपनिषद् (02, 23) में कहा गया है कि धर्म के तीन स्कन्ध हैं।\nयज्ञ, अध्ययन और दान\nमनुष्य के कर्तव्य एवं अधिकार, वर्ण-विशेष तथा आश्रम-विशेष से सम्बन्धित व्यक्ति के रूप में उसके आचार एवं व्यवहार।\nइस प्रकार धर्म शब्द अनेक अर्थों का द्योतक है, इसलिए मनुस्मृति एवं याज्ञवल्क्य स्मृति में धर्म शब्द अत्यन्त व्यापक अर्थों में प्रयुक्त हुआ है।\nमनुष्यधर्म के नियम, सूत्र रूप में होने के कारण इन सूत्रों को धर्मसूत्र कहते हैं। मानवीय जीवनशोधन की आचार संहिता धर्मसूत्र है। धर्मसूत्रों में व्यक्ति को समाज के योग्य एवं श्रेष्ठ मानव के रूप में निर्मित करने का प्रयास किया गया है। इन सूत्रों में समाज के व्यावहारिक पहलुओं पर विचार करते हुए मानवीय सामाजिक जीवन को व्यवस्थित करने के नियमों का वर्णन किया गया है। धर्म का स्वरूप एवं उसके उपादान, सभी वर्णों के लिए धर्म के आचार-व्यवहार, कर्तव्य-अकर्तव्य, वर्णाश्रम धर्म की व्याख्या, ब्रह्मचर्य, गृहस्थ, वानप्रस्थ, संन्यास आश्रमों के समय, नियम एवं कर्तव्यों का निर्धारण, विभिन्न जातियों एवं उपजातियों के सम्मिश्रण, सपिण्ड एवं सगोत्र परिवारों का विवेचन, अनेक प्रकार के पापों तथा उनके प्रायश्चित्तों का विधान, विभिन्न प्रकार के व्रत, अशौच, काल तथा शुद्धियों के प्रकार, अपराध तथा उनके व्यावहारिक दण्डों की प्रक्रिया, ऋण तथा उसका ब्याज, साक्षी के कर्तव्य, स्त्री, पुत्र, दत्तकपुत्र, पति के सम्बन्ध एवं कर्तव्य, उत्तराधिकारी के नियम तथा सम्पत्ति विभाजन की विधाओं आदि का विस्तृत विवेचन किया गया है।\nवर्तमान समय में उपलब्ध धर्मसूत्र इस प्रकार हैं।\nऋग्वेद\nवशिष्ठ धर्मसूत्र\nशुक्ल यजुर्वेद\nविष्णु धर्मसूत्र\nकृष्ण यजुर्वेद\nबौधायन धर्मसूत्र\nआपस्तम्ब धर्मसूत्र\nसाम वेद\nगौतम धर्मसूत्र\nशुल्बसूत्र एक संक्षिप्त परिचय\nशुल्ब का अर्थ होता है –माप। भूमि के नापने के कार्य से सम्बन्ध रखनेवाले सूत्र को शुल्बसूत्र कहा जाता है। प्राचीन काल से ही मापन की प्रक्रिया प्रचलित है। किसी भी प्रकार के यज्ञ में माप की अत्यन्त आवश्यकता होती है जैसे यज्ञमण्डप का माप,  यज्ञवेदियों का माप, यज्ञशाला की ऊंचाई का माप, यज्ञ कुण्ड का माप इत्यादि। इन्हीं सूत्रों में ही भूमि के चतुरस्र भाग को वृत्ताकार एवं वृत्ताकार को चतुरस्र करने के नियम है।\nचतुस्रं मण्डलं चिकीर्षन् मध्यादंसे निपात्य पार्वतः परिलिख्य\nतत्र यदतिरिक्तं भवति तस्य तृतीयेन मण्डलं परिलिखेत्स समाधिः॥\nशुल्बसूत्र को ही भारतीय ज्यामिति का आधार माना जाता है। जिस प्रकार संसार के समस्त धर्मों का मूल वेद है उसी प्रकार समस्त शिल्प का आधार शुल्बसूत्र है कहना अतिशयोक्ति नहीं होगी।\nवर्तमान समय में उपलब्ध शुल्बसूत्र इस प्रकार हैः-\nशुक्ल यजुर्वेद\nकात्यायन शुल्बसूत्र\nकृष्ण यजुर्वेद\nबौधायन शुल्बसूत्र\nआपस्तम्ब शुल्बसूत्र\nमानव शुल्बसूत्र\nशिक्षा वेदांग का परिचय – श्री रमण शर्मा\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "कल्प | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/hi/vedangas/kalpa/",
  "source": "vedicheritage",
  "format": "html",
  "language": "hi-in",
  "category": "Vedas",
  "author": null,
  "scraped_at": "2025-10-17 15:05:16.975804",
  "file_size": 210748,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}