{
  "text": "वेदनगस\nनिरुक्त\nVEDANGAS\nशिक्षा\nकल्प\nव्याकरण\nनिरुक्त\nछन्द\nज्योतिष\nNirukta\nNirukta Vedanga is called the ears of the Veda Purusha. ‘Nirukta’ means ‘etymology’ and it explains the reason why a particular word has been used i.e., the meaning of usage. The only work which has survived as a specimen of this Vedanga ‘etymology’ is the Nirukta of Yaska. It is a commentary on\nNighantu\nwhich is ‘list of words’ found in the Vedas. Tradition ascribes the Nighantu also to Yaska. The Nighantus are five lists of words, which are again divided into three sections. The first section consists of three lists, in which Vedic words are collected under certain main ideas. The second section contains a list of ambiguous and particularly difficult words of the Veda, while the third section gives a classification of the deities according to the three regions, earth, sky and heaven. Yaska explained these lists in the twelve books followed. The most interesting portion of the Nirukta is the discussion which covers the whole of the first book and a part of the second, as well as the seventh book, which was as an admirable introduction to the study of the Veda.Yaska has mentioned a considerable number of important grammarians as his predecessors in the Nirukta such as Galava, Shakapuni, Katthakya.Niruka is very important for several reasons. Firstly, it represents the type of the earliest classical style and in this respect stands by itself. Secondly, it is the oldest known attempt in the field of Vedic etymology. As regards the importance of the etymology Yaska himself says that without it the precise meanings of the Vedic stanzas cannot be understood\nLinks\nNirukta – With the commentary of Sri Devarajayajva\nVolume I\nVolume II\nVolume III\nVolume IV\nMultimedia Link\nनिरुक्त वेदाङ्ग का सामान्य परिचय\nनिरुक्त वेदाङ्ग का सामान्य परिचय\nशिक्षा वेदांग का परिचय – श्री रमण शर्मा\nTop\nSocial Sidebar\nPlease enable JavaScript in your browser to view the content",
  "title": "निरुक्त | Vedic Heritage Portal",
  "url": "https://vedicheritage.gov.in/hi/vedangas/nirukta/",
  "source": "vedicheritage",
  "format": "html",
  "language": "hi-in",
  "category": "Vedas",
  "author": null,
  "scraped_at": "2025-10-17 15:05:32.818420",
  "file_size": 188954,
  "encoding": "UTF-8",
  "page_count": null,
  "processing_time": 0.0,
  "retry_count": 0,
  "confidence_score": 1.0,
  "tags": [],
  "properties": {}
}